GetElementOverrides Method
 Gets graphic overrides for an element in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public OverrideGraphicSettings GetElementOverrides(
	ElementId elementId
)
Visual Basic
Public Function GetElementOverrides ( _
	elementId As ElementId _
) As OverrideGraphicSettings
Visual C++
public:
OverrideGraphicSettings^ GetElementOverrides(
	ElementId^ elementId
)
Parameters
elementId
Type: Autodesk.Revit.DBElementId
 The element.
Return Value
 An object representing all graphic overrides of the element elementId in view.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  elementId is not a valid Element identifier.
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
Autodesk.Revit.ExceptionsInvalidOperationException |  The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →